Repository: FrancescoCaracciolo/Newelle
Catalog: po/*.po
Languages: ar

source: Extensions
ar: إضافات

source: Choose an extension
ar: إختر إضافة

source: has been removed
ar: تم إزالته

source: Add extension
ar: أضف إضافة

source: Extension added. New extensions will run from the next launch
ar: تمت إضافة الإضافة. سيتم تفعيل الإضافات الجديدة عند إعادة تشغيل البرنامج

source: The extension is wrong
ar: الإضافة خاطئة

source: This is not an extension
ar: هذا ليس إضافة

source: Terminal threads are still running in the background
ar: لا تزال العمليات جارية في الخلفية

source: When you close the window, they will be automatically terminated
ar: عندما تغلق النافذة, سيتم إقفالهم تلقائيا

source: Cancel
ar: إلغاء

source: Close
ar: قفل

source: Chat is rebooted
ar: تم إعادة تشغيل الدردشة

source: Folder is rebooted
ar: تم إعادة تشغيل المجلد

source: Chat is created
ar: تم إنشاء دردشة

source: Chat
ar: دردشة

source: Thread editing
ar: تعديل الخيوط

source: Settings
ar: الإعدادات

source: Keyboard shorcuts
ar: إختصارات لوحة المفاتيح

source: About
ar: عن

source: Chat
ar: دردشة

source: History
ar: سجل

source: Create a chat
ar: إبدأ محادثة

source: Stop
ar: توقف

source: Clear
ar: حذف

source: Continue
ar: تابع

source: Regenerate
ar: إعادة الصياغة

source: File not found
ar: الملف غير موجود

source: The file cannot be sent until the program is finished
ar: لا يمكن إرسال الملف الى أن ينتهي البرنامج

source: The file is not recognized
ar: الملف غير معرف

source: You can no longer continue the message.
ar: لا يمكنك إكمال الرسالة

source: You can no longer regenerate the message.
ar: لا يمكنك إعادة صياغة الرسالة

source: Chat is empty
ar: المحادثة فارغة

source: Chat is cleared
ar: تم حذف المحادثة

source: The message was canceled and deleted from history
ar: تم إلغاء الرسالة وحذفها من السجل

source: Failed to send bot a message
ar: فشل إرسال الرسالة الى الآلة

source: Chat has been stopped
ar: تم توقيف المحادثة

source: Folder is Empty
ar: المجلد فارغ

source: Wrong folder path
ar: مسار الملف خاطئ

source: Thread has not been completed, thread number:
ar: لم يتم إكمال الخيط, الخيط رقم:

source: Failed to open the folder
ar: تعذر فتح المجلد

source: The message cannot be sent until the program is finished
ar: لا يمكن إرسال الرسالة الى أن ينتهي البرنامج

source: You can't edit a message while the program is running.
ar: لا يمكنك تعديل الرسالة أثناء تشغيل البرنامج

source: Attention the neural network has access to your computer, be careful, we are not responsible for the neural network.
ar: تحذير! للشبكة العصبونية الإصطناعية قابلية للوصول إلى جهازك, كن حذرا, نحن لسنامسؤولين عن الشبكة العصبونية الإصطناعية

source: No threads are running
ar: لا توجد خيوط جارية

source: Thread number:
ar: الخيط رقم:

source: Help
ar: مساعدة

source: Shortcuts
ar: إختصارات

source: Reload chat
ar: إعادة تحميل الدردشة

source: Reload folder
ar: إعادة تحميل المجلد

source: New tab
ar: علامة تبويب جديدة

source: Interface
ar: واجهة

source: Hidden files
ar: الملفات المخفية

source: Show hidden files
ar: أظهر الملفات المخفية

source: Number of offers
ar: عدد العروض

source: Number of message suggestions to send to chat
ar: عدد اقتراحات الرسائل التي سيتم إرسالها إلى الدردشة

source: Prompt control
ar: التحكم بالردود

source: Auto-run commands
ar: تشغيل الأوامر تلقائيا

source: Commands that the bot will write will automatically run
ar: سيتم تشغيل الأوامر التي سيكتبها الروبوت تلقائيًا

source: Console access
ar: الوصول إلى وحدة التحكم

source: Can the program run terminal commands on the computer
ar: هل يمكن للبرنامج تشغيل الأوامر على الجهاز

source: Graphs access
ar: الوصول إلى الرسوم البيانية

source: Can the program display graphs
ar: هل يمكن للبرنامج عرض الرسوم البيانية

source: Basic functionality
ar: وظائف أساسية

source: Showing tables and code (*can work without it)
ar: عرض الجداول والأكواد البرمجية (*يمكن العمل بدونها)

source: Show image
ar: إظهار الصور

source: Show image in chat
ar: إظهار الصور في الدردشة

source: Neural Network Control
ar: التحكم في الشبكة العصبونية الإصطناعية

source: Command virtualization
ar: أوامر افتراضية

source: Run commands in a virtual machine
ar: تشغيل الأوامر في بيئة افتراضية

source: Program memory
ar: ذاكرة البرنامج

source: How long the program remembers the chat
ar: كم من الوقت يتذكر البرنامج المحادثة

source: The change will take effect after you restart the program.
ar: سيتم إحداث التغييرات بعد إعادة تشغيل البرنامج
